app/Models/Product_model.php

SELECT *
FROM `category`
---
    public function getCategory()
    {
        $builder = $this->db->table('category');
        return $builder->get();

SELECT *
FROM `product`
LEFT JOIN `category` ON `category_id` = `product_category_id`
---
    public function getProduct()
    {
        $builder = $this->db->table('product');
        $builder->select('*');
        $builder->join('category', 'category_id = product_category_id','left');
        return $builder->get();

SELECT *
FROM `administradores`
---
    public function getAdm()
    {
        $builder = $this->db->table('administradores');
        $builder->select('*');

        return $builder->get();

SELECT *
FROM `alunos`
---
    public function getAluno()
    {
        $builder = $this->db->table('alunos');
        $builder->select('*');

        return $builder->get();